Джунам:
прочитать статьи
сделать кастомные урлы для базы
можно сразу с импортированными данными
застрянут с фб ключом
сделать статью как Contribute
отдельный файл с описанием урлов АПИ проекта
Описание основных страниц проекта
и что на них сейчас выводится
могут создать первые файлы для импорта - nutritions & Measurements
favorite
prices
пусть придумают куда добавить ввод цен за ингредиенты
могут просмотреть файлы в которыз найти todo и сделать так
<text> ссылка на функцию в файле и имя файла
перевести инфу из докс в файлы


перебрать список задач для джуниоров
пусть они придумают что можно проимпрувить на сайте - их мнение

пусть опишут детально, какой есть функционал у других шоппнг лист апп с примерами и скриншотами

список articles to read
написать тесты для проверки основных роутов = залить в репозиторий, я проверю как работает в другой ветке, если ок, тогда я добавлю в основной проекте
перенос оставшизся функций из роутов, в контроллер

уточнить, что они должны коммитить изменения и писать отчет о том, что было сделанно

пусть придумают план как сделать автоматический шоппинг лист и соединение юнитов

план как хранить в базе уже использованные листы и как это сделать со стороны фронтенда

все айтемы станут purchased и выводить их потом уже без purchased или без цены

разобраться где я спрятал фавориты и отобразить их обратно на дев версии проекта


---------------------------

Расскажу о проекте Recipe api. месяцев 6 назад я не доводил код этого проекта до релиза.
мы работали hard. я как основной разработчик очень ленивый и могу отвлекаться. поэтому летом я вначале отвлекся
на создание проекта GroceriStar - он использует 20% от всех возможностей recipe api server
потом я начал делать бота для гитхаба
но недавно один из участников команды согласился помочь мне над другой частью проекта - проект по созданию расширенной формы поиска рецептов
он начал делать этот проект с нуля. со временем этот проект войдет в основной большой проекте
экосистема проектов recipe api server очень большая

можно скатзать что форма это не тот элемент который надо выносить в отдельный проект
но сделав форму отдельным проектом мы можем экономить время других разработчиков

когда он доделал свою часть - возник вопрос - как тестировать роботу формы .
пришлось добавить данные в основной проект чтобы связать базу данных и форму
пришлось переделать схемы на основных моделях проекта
я также переписал функционал импорта - изза того что увеличилось количество таблиц и связей междк ними - держать все в одном файле было непрактично.
благодаря переработке функционала импорта я также продвинулся в 2х других своих проектах, которые тоже использовали предыдущую версию скрипта


Также мы вдохновились другим проектом - линк и скопировали данные из его select field/
таким образом мы получили базу ингредиентов 1600штук
мы считаем что и другие девы обязаны импортировать данные хотябы вначале, чтобы не тратить время на research
мы позже выложим структуру базы данных и данные по Measurements и другие данные.
по диетам, аллергиям и т.д.

или основные данные, которые нужны в подобных проектах

в следующий статье я попробую объяснить и описать реально ли функционал который я создал может быть полезен на проекте, который делается с нуля
это идеальный вариант когда можно взять исходный код и дорабатывать его до ваших нужд

или если уже есть база данных, связи между данными есть основной code base но они хотят постепенно перейти на новые технологии, на более быстрый workflow, на более широкий функционал и т.д.
для этого я попробую импортировать данные из одного проекта с рецептами и ингредиентами к себе.
там примерно 11к рецептов и проверю свой проект на прочность, на качество работы и вообще возможно ли это сделать быстро.

свои шаги я опишу и возможно ктото начал бы использовать api server для своего проекта


Если говорить о будущем расширении функционала - то это Measurements & Unit Convertion
и автоматический гросерились - это то что интересно делать
картинки и их поддержку мы пока не добавляем, но loopback имеет хороший туториал на эту тему

еще я хочу Forest Admin, т.к. меня вдохновляют эти парни и их идея не создавать админку снуля.

Кроме всего прочего мы интегрировали в проект простую версию grocery list функциональости - делали мы это на основе базового функционала GroceriStar проекта - ведь там все было протестировано
GL работает в автоматическом режиме, у него есть свои недостатки но текущая позиция сможет помочь вашими
